modm-ext/data.modm.io/docs/svd/header_stm32g473xx.svd
        <register>
          <name>SHRR</name>
          <description>DAC Sample and Hold refresh time register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TREFRESH1</name>
              <description>DAC channel1 refresh time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TREFRESH2</name>
              <description>DAC channel2 refresh time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STR1</name>
          <description>DAC Sawtooth register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STRSTDATA1</name>
              <description>DAC Channel 1 Sawtooth starting value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>STDIR1</name>
              <description>DAC Channel 1 Sawtooth direction setting</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STINCDATA1</name>
              <description>DAC Channel 1 Sawtooth increment value (12.4 bit format)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STR2</name>
          <description>DAC Sawtooth register</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STRSTDATA2</name>
              <description>DAC Channel 2 Sawtooth starting value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>STDIR2</name>
              <description>DAC Channel 2 Sawtooth direction setting</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STINCDATA2</name>
              <description>DAC Channel 2 Sawtooth increment value (12.4 bit format)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STMODR</name>
          <description>DAC Sawtooth Mode register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STRSTTRIGSEL1</name>
              <description>STRSTTRIGSEL1[3:0] (DAC Channel 1 Sawtooth Increment trigger selection)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STINCTRIGSEL1</name>
              <description>STINCTRIGSEL1[3:0] (DAC Channel 1 Sawtooth Increment trigger selection)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STRSTTRIGSEL2</name>
              <description>STRSTTRIGSEL2[3:0] (DAC Channel 2 Sawtooth Increment trigger selection)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STINCTRIGSEL2</name>
              <description>STINCTRIGSEL2[3:0] (DAC Channel 2 Sawtooth Increment trigger selection)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="DAC">
      <name>DAC1</name>
      <description>Digital to Analog Converter</description>
      <groupName>DAC</groupName>
      <alternatePeripheral>DAC</alternatePeripheral>
      <baseAddress>0x50000800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DAC">
      <name>DAC2</name>
      <description>Digital to Analog Converter</description>
      <groupName>DAC</groupName>
      <baseAddress>0x50000c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DAC">
      <name>DAC3</name>
      <description>Digital to Analog Converter</description>
      <groupName>DAC</groupName>
      <baseAddress>0x50001000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DAC">
      <name>DAC4</name>
      <description>Digital to Analog Converter</description>
      <groupName>DAC</groupName>
      <baseAddress>0x50001400</baseAddress>
    </peripheral>
    <peripheral>
      <name>RNG</name>
      <description>RNG</description>
      <groupName>RNG</groupName>
      <baseAddress>0x50060800</baseAddress>
      <interrupt>
        <name>RNG</name>
        <description>RNG global interrupt</description>
        <value>90</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>RNG control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RNGEN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CED</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>RNG status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DRDY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CECS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEIS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>RNG data register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
